sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Inc/py32f003_ll_rcc.h
/** @defgroup RCC_LL_EF_RTC RTC
  * @{
  */

/**
  * @brief  Set RTC Clock Source
  * @note Once the RTC clock source has been selected, it cannot be changed anymore unless
  *       the Backup domain is reset, or unless a failure is detected on LSE (LSECSSD is
  *       set). The BDRST bit can be used to reset them.
  * @rmtoll BDCR         RTCSEL        LL_RCC_SetRTCClockSource
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_NONE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_HSE_DIV32
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetRTCClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->BDCR, RCC_BDCR_RTCSEL, Source);
}

/**
  * @brief  Get RTC Clock Source
  * @rmtoll BDCR         RTCSEL        LL_RCC_GetRTCClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_NONE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_HSE_DIV32
  */
__STATIC_INLINE uint32_t LL_RCC_GetRTCClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->BDCR, RCC_BDCR_RTCSEL));
}

/**
  * @brief  Enable RTC
  * @rmtoll BDCR         RTCEN         LL_RCC_EnableRTC
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableRTC(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_RTCEN);
}

/**
  * @brief  Disable RTC
  * @rmtoll BDCR         RTCEN         LL_RCC_DisableRTC
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableRTC(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_RTCEN);
}

/**
  * @brief  Check if RTC has been enabled or not
  * @rmtoll BDCR         RTCEN         LL_RCC_IsEnabledRTC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledRTC(void)
{
  return ((READ_BIT(RCC->BDCR, RCC_BDCR_RTCEN) == (RCC_BDCR_RTCEN)) ? 1UL : 0UL);
}

/**
  * @brief  Force the Backup domain reset
  * @rmtoll BDCR         BDRST         LL_RCC_ForceBackupDomainReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ForceBackupDomainReset(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_BDRST);
}

/**
  * @brief  Release the Backup domain reset
  * @rmtoll BDCR         BDRST         LL_RCC_ReleaseBackupDomainReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ReleaseBackupDomainReset(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_BDRST);
}

/**
  * @}
  */


///** @defgroup RCC_LL_EF_PLL PLL
//  * @{
//  */

///**
//  * @brief  Enable PLL
//  * @rmtoll CR           PLLON         LL_RCC_PLL_Enable
//  * @retval None
//  */
//__STATIC_INLINE void LL_RCC_PLL_Enable(void)
//{
//  SET_BIT(RCC->CR, RCC_CR_PLLON);
//}

///**
//  * @brief  Disable PLL
//  * @note Cannot be disabled if the PLL clock is used as the system clock
//  * @rmtoll CR           PLLON         LL_RCC_PLL_Disable
//  * @retval None
//  */
//__STATIC_INLINE void LL_RCC_PLL_Disable(void)
//{
//  CLEAR_BIT(RCC->CR, RCC_CR_PLLON);
//}

///**
//  * @brief  Check if PLL Ready
//  * @rmtoll CR           PLLRDY        LL_RCC_PLL_IsReady
//  * @retval State of bit (1 or 0).
//  */
//__STATIC_INLINE uint32_t LL_RCC_PLL_IsReady(void)
//{
//  return ((READ_BIT(RCC->CR, RCC_CR_PLLRDY) == (RCC_CR_PLLRDY)) ? 1UL : 0UL);
//}

///**
//  * @brief  Configure PLL used for SYSCLK Domain
//  * @note PLL Source can be written only when PLL is disabled
//  * @note PLLR can be written only when PLL is disabled
//  * @rmtoll PLLCFGR      PLLSRC        LL_RCC_PLL_ConfigDomain_SYS
//  * @param  Source This parameter can be one of the following values:
//  *         @arg @ref LL_RCC_PLLSOURCE_NONE
//  *         @arg @ref LL_RCC_PLLSOURCE_HSI
//  *         @arg @ref LL_RCC_PLLSOURCE_HSE
//  * @retval None
//  */
//__STATIC_INLINE void LL_RCC_PLL_ConfigDomain_SYS(uint32_t Source)
//{
//  MODIFY_REG(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC, Source);
//}

///**
//  * @brief  Configure PLL used for ADC domain clock
//  * @note   PLL Source and PLLM Divider can be written only when PLL is disabled
//  * @note   PLLN/PLLP can be written only when PLL is disabled
//  * @note   User shall verify whether the PLL configuration is not done through
//  *         other functions (ex: I2S1)
//  * @note   This can be selected for ADC
//  * @rmtoll PLLCFGR      PLLSRC        LL_RCC_PLL_ConfigDomain_ADC\n
//  *         PLLCFGR      PLLM          LL_RCC_PLL_ConfigDomain_ADC\n
//  *         PLLCFGR      PLLN          LL_RCC_PLL_ConfigDomain_ADC\n
//  *         PLLCFGR      PLLP          LL_RCC_PLL_ConfigDomain_ADC
//  * @param  Source This parameter can be one of the following values:
//  *         @arg @ref LL_RCC_PLLSOURCE_NONE
//  *         @arg @ref LL_RCC_PLLSOURCE_HSI
//  *         @arg @ref LL_RCC_PLLSOURCE_HSE
//  * @param  PLLM This parameter can be one of the following values:
//  *         @arg @ref LL_RCC_PLLM_DIV_1
//  *         @arg @ref LL_RCC_PLLM_DIV_2
//  *         @arg @ref LL_RCC_PLLM_DIV_3
//  *         @arg @ref LL_RCC_PLLM_DIV_4
//  *         @arg @ref LL_RCC_PLLM_DIV_5
//  *         @arg @ref LL_RCC_PLLM_DIV_6
//  *         @arg @ref LL_RCC_PLLM_DIV_7
//  *         @arg @ref LL_RCC_PLLM_DIV_8
//  * @param  PLLN Between 8 and 86
//  * @param  PLLP This parameter can be one of the following values:
//  *         @arg @ref LL_RCC_PLLP_DIV_2
//  *         @arg @ref LL_RCC_PLLP_DIV_3
//  *         @arg @ref LL_RCC_PLLP_DIV_4
//  *         @arg @ref LL_RCC_PLLP_DIV_5
//  *         @arg @ref LL_RCC_PLLP_DIV_6
//  *         @arg @ref LL_RCC_PLLP_DIV_7
//  *         @arg @ref LL_RCC_PLLP_DIV_8
//  *         @arg @ref LL_RCC_PLLP_DIV_9
//  *         @arg @ref LL_RCC_PLLP_DIV_10
//  *         @arg @ref LL_RCC_PLLP_DIV_11
//  *         @arg @ref LL_RCC_PLLP_DIV_12
//  *         @arg @ref LL_RCC_PLLP_DIV_13
//  *         @arg @ref LL_RCC_PLLP_DIV_14
//  *         @arg @ref LL_RCC_PLLP_DIV_15
//  *         @arg @ref LL_RCC_PLLP_DIV_16
//  *         @arg @ref LL_RCC_PLLP_DIV_17
//  *         @arg @ref LL_RCC_PLLP_DIV_18
//  *         @arg @ref LL_RCC_PLLP_DIV_19
//  *         @arg @ref LL_RCC_PLLP_DIV_20
//  *         @arg @ref LL_RCC_PLLP_DIV_21
//  *         @arg @ref LL_RCC_PLLP_DIV_22
//  *         @arg @ref LL_RCC_PLLP_DIV_23
//  *         @arg @ref LL_RCC_PLLP_DIV_24
//  *         @arg @ref LL_RCC_PLLP_DIV_25
//  *         @arg @ref LL_RCC_PLLP_DIV_26
//  *         @arg @ref LL_RCC_PLLP_DIV_27
//  *         @arg @ref LL_RCC_PLLP_DIV_28
//  *         @arg @ref LL_RCC_PLLP_DIV_29
//  *         @arg @ref LL_RCC_PLLP_DIV_30
//  *         @arg @ref LL_RCC_PLLP_DIV_31
//  *         @arg @ref LL_RCC_PLLP_DIV_32
//  * @retval None
//  */
//__STATIC_INLINE void LL_RCC_PLL_ConfigDomain_ADC(uint32_t Source, uint32_t PLLM, uint32_t PLLN, uint32_t PLLP)
//{
//  MODIFY_REG(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC | RCC_PLLCFGR_PLLM | RCC_PLLCFGR_PLLN | RCC_PLLCFGR_PLLP,
//             Source | PLLM | (PLLN << RCC_PLLCFGR_PLLN_Pos) | PLLP);
//}

///**
//  * @brief  Configure PLL used for I2S domain clock
//  * @note   PLL Source and PLLM Divider can be written only when PLL is disabled
//  * @note   PLLN/PLLP can be written only when PLL is disabled
//  * @note   User shall verify whether the PLL configuration is not done through
//  *         other functions (ex: ADC)
//  * @note   This can be selected for I2S1
//  * @rmtoll PLLCFGR      PLLSRC        LL_RCC_PLL_ConfigDomain_I2S1\n
//  *         PLLCFGR      PLLM          LL_RCC_PLL_ConfigDomain_I2S1\n
//  *         PLLCFGR      PLLN          LL_RCC_PLL_ConfigDomain_I2S1\n
//  *         PLLCFGR      PLLP          LL_RCC_PLL_ConfigDomain_I2S1
//  * @param  Source This parameter can be one of the following values:
//  *         @arg @ref LL_RCC_PLLSOURCE_NONE
//  *         @arg @ref LL_RCC_PLLSOURCE_HSI
//  *         @arg @ref LL_RCC_PLLSOURCE_HSE
//  * @param  PLLM This parameter can be one of the following values:
//  *         @arg @ref LL_RCC_PLLM_DIV_1
//  *         @arg @ref LL_RCC_PLLM_DIV_2
//  *         @arg @ref LL_RCC_PLLM_DIV_3
//  *         @arg @ref LL_RCC_PLLM_DIV_4
//  *         @arg @ref LL_RCC_PLLM_DIV_5
//  *         @arg @ref LL_RCC_PLLM_DIV_6
//  *         @arg @ref LL_RCC_PLLM_DIV_7
//  *         @arg @ref LL_RCC_PLLM_DIV_8
//  * @param  PLLN Between 8 and 86
//  * @param  PLLP This parameter can be one of the following values:
//  *         @arg @ref LL_RCC_PLLP_DIV_2
//  *         @arg @ref LL_RCC_PLLP_DIV_3
//  *         @arg @ref LL_RCC_PLLP_DIV_4
//  *         @arg @ref LL_RCC_PLLP_DIV_5
//  *         @arg @ref LL_RCC_PLLP_DIV_6
//  *         @arg @ref LL_RCC_PLLP_DIV_7
//  *         @arg @ref LL_RCC_PLLP_DIV_8
//  *         @arg @ref LL_RCC_PLLP_DIV_9
//  *         @arg @ref LL_RCC_PLLP_DIV_10
//  *         @arg @ref LL_RCC_PLLP_DIV_11
//  *         @arg @ref LL_RCC_PLLP_DIV_12
//  *         @arg @ref LL_RCC_PLLP_DIV_13
//  *         @arg @ref LL_RCC_PLLP_DIV_14
//  *         @arg @ref LL_RCC_PLLP_DIV_15
//  *         @arg @ref LL_RCC_PLLP_DIV_16
//  *         @arg @ref LL_RCC_PLLP_DIV_17
//  *         @arg @ref LL_RCC_PLLP_DIV_18
//  *         @arg @ref LL_RCC_PLLP_DIV_19
//  *         @arg @ref LL_RCC_PLLP_DIV_20
//  *         @arg @ref LL_RCC_PLLP_DIV_21
//  *         @arg @ref LL_RCC_PLLP_DIV_22
//  *         @arg @ref LL_RCC_PLLP_DIV_23
//  *         @arg @ref LL_RCC_PLLP_DIV_24
//  *         @arg @ref LL_RCC_PLLP_DIV_25
//  *         @arg @ref LL_RCC_PLLP_DIV_26
//  *         @arg @ref LL_RCC_PLLP_DIV_27
//  *         @arg @ref LL_RCC_PLLP_DIV_28
//  *         @arg @ref LL_RCC_PLLP_DIV_29
//  *         @arg @ref LL_RCC_PLLP_DIV_30
//  *         @arg @ref LL_RCC_PLLP_DIV_31
//  *         @arg @ref LL_RCC_PLLP_DIV_32
//  * @retval None
//  */
//__STATIC_INLINE void LL_RCC_PLL_ConfigDomain_I2S1(uint32_t Source, uint32_t PLLM, uint32_t PLLN, uint32_t PLLP)
//{
//  MODIFY_REG(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC | RCC_PLLCFGR_PLLM | RCC_PLLCFGR_PLLN | RCC_PLLCFGR_PLLP,
//             Source | PLLM | (PLLN << RCC_PLLCFGR_PLLN_Pos) | PLLP);
//}

#if defined(RNG)
/**
  * @brief  Configure PLL used for RNG domain clock
  * @note PLL Source and PLLM Divider can be written only when PLL is disabled
  * @note PLLN/PLLQ can be written only when PLL is disabled
  * @note   User shall verify whether the PLL configuration is not done through
  *         other functions (ex: TIM1, TIM15)
  * @note This  can be selected for RNG
  * @rmtoll PLLCFGR      PLLSRC        LL_RCC_PLL_ConfigDomain_RNG\n
  *         PLLCFGR      PLLM          LL_RCC_PLL_ConfigDomain_RNG\n
  *         PLLCFGR      PLLN          LL_RCC_PLL_ConfigDomain_RNG\n
  *         PLLCFGR      PLLQ          LL_RCC_PLL_ConfigDomain_RNG
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLLSOURCE_NONE
  *         @arg @ref LL_RCC_PLLSOURCE_HSI
  *         @arg @ref LL_RCC_PLLSOURCE_HSE
  * @param  PLLM This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLLM_DIV_1
  *         @arg @ref LL_RCC_PLLM_DIV_2
  *         @arg @ref LL_RCC_PLLM_DIV_3
  *         @arg @ref LL_RCC_PLLM_DIV_4
  *         @arg @ref LL_RCC_PLLM_DIV_5
  *         @arg @ref LL_RCC_PLLM_DIV_6
  *         @arg @ref LL_RCC_PLLM_DIV_7
  *         @arg @ref LL_RCC_PLLM_DIV_8
  * @param  PLLN Between 8 and 86
  * @param  PLLQ This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLLQ_DIV_2
  *         @arg @ref LL_RCC_PLLQ_DIV_3
  *         @arg @ref LL_RCC_PLLQ_DIV_4
  *         @arg @ref LL_RCC_PLLQ_DIV_5
  *         @arg @ref LL_RCC_PLLQ_DIV_6
  *         @arg @ref LL_RCC_PLLQ_DIV_7
  *         @arg @ref LL_RCC_PLLQ_DIV_8
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_ConfigDomain_RNG(uint32_t Source, uint32_t PLLM, uint32_t PLLN, uint32_t PLLQ)
{
  MODIFY_REG(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC | RCC_PLLCFGR_PLLM | RCC_PLLCFGR_PLLN | RCC_PLLCFGR_PLLQ,
             Source | PLLM | (PLLN << RCC_PLLCFGR_PLLN_Pos) | PLLQ);
}
#endif /* RNG */

#if defined(RCC_PLLQ_SUPPORT)
/**
  * @brief  Configure PLL used for TIM1 domain clock
  * @note PLL Source and PLLM Divider can be written only when PLL is disabled
  * @note PLLN/PLLQ can be written only when PLL is disabled
  * @note   User shall verify whether the PLL configuration is not done through
  *         other functions (ex: RNG, TIM15)
  * @note This  can be selected for TIM1
  * @rmtoll PLLCFGR      PLLSRC        LL_RCC_PLL_ConfigDomain_TIM1\n
  *         PLLCFGR      PLLM          LL_RCC_PLL_ConfigDomain_TIM1\n
  *         PLLCFGR      PLLN          LL_RCC_PLL_ConfigDomain_TIM1\n
  *         PLLCFGR      PLLQ          LL_RCC_PLL_ConfigDomain_TIM1
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLLSOURCE_NONE
  *         @arg @ref LL_RCC_PLLSOURCE_HSI
  *         @arg @ref LL_RCC_PLLSOURCE_HSE
  * @param  PLLM This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLLM_DIV_1
  *         @arg @ref LL_RCC_PLLM_DIV_2
  *         @arg @ref LL_RCC_PLLM_DIV_3
  *         @arg @ref LL_RCC_PLLM_DIV_4
  *         @arg @ref LL_RCC_PLLM_DIV_5
  *         @arg @ref LL_RCC_PLLM_DIV_6
  *         @arg @ref LL_RCC_PLLM_DIV_7
  *         @arg @ref LL_RCC_PLLM_DIV_8
  * @param  PLLN Between 8 and 86
  * @param  PLLQ This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLLQ_DIV_2
  *         @arg @ref LL_RCC_PLLQ_DIV_3
  *         @arg @ref LL_RCC_PLLQ_DIV_4
  *         @arg @ref LL_RCC_PLLQ_DIV_5
  *         @arg @ref LL_RCC_PLLQ_DIV_6
  *         @arg @ref LL_RCC_PLLQ_DIV_7
  *         @arg @ref LL_RCC_PLLQ_DIV_8
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_ConfigDomain_TIM1(uint32_t Source, uint32_t PLLM, uint32_t PLLN, uint32_t PLLQ)
{
  MODIFY_REG(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC | RCC_PLLCFGR_PLLM | RCC_PLLCFGR_PLLN | RCC_PLLCFGR_PLLQ,
             Source | PLLM | (PLLN << RCC_PLLCFGR_PLLN_Pos) | PLLQ);
}
#endif /* RCC_PLLQ_SUPPORT */

